;Place localized text in this file
[MrC_APA_CombatEngineer X2EncyclopediaTemplate]
ListTitle = "战斗工程师"
DescriptionTitle = "战斗工程师"
DescriptionEntry = "战斗工程师擅长使用他们的手套、小工具以及霰弹枪或大炮在战场上提供进攻和防御支持。"

[MrC_APA_CombatEngineer X2SoldierClassTemplate]
DisplayName = "战斗工程师"
ClassSummary = "战斗工程师擅长使用他们的手套、小工具以及霰弹枪或大炮在战场上提供进攻和防御支持。"
AbilityTreeTitles[0] = "专家"
AbilityTreeTitles[1] = "突击队"
AbilityTreeTitles[2] = "操作手"
AbilityTreeTitles[3] = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"

RandomNickNames[0]=Blazer
RandomNickNames[1]=Flame Tongue
RandomNickNames[2]=Gizmo
RandomNickNames[3]=Hades
RandomNickNames[4]=Hellion
RandomNickNames[5]=Pioneer
RandomNickNames[6]=Pyro
RandomNickNames[7]=Smoker
RandomNickNames[8]=Spanners
RandomNickNames[9]=Toaster
RandomNickNames[10]=Wrench
RandomNickNames_Male[0]=Apollo
RandomNickNames_Male[1]=Archimedes
RandomNickNames_Male[2]=Daedalus
RandomNickNames_Male[3]=Dragon
RandomNickNames_Male[4]=Edison
RandomNickNames_Female[0]=Artemis
RandomNickNames_Female[1]=Autumn
RandomNickNames_Female[2]=Ferrer
RandomNickNames_Female[3]=Saphira
RandomNickNames_Female[4]=Summer

PhotoboothSoloALines_Male[0]="乒乒乓乓！然后...砰！"
PhotoboothSoloALines_Male[1]="警报！附加伤害。"
PhotoboothSoloALines_Male[2]="祈祷吧。这没有怜悯！"
PhotoboothSoloALines_Male[3]="燃烧一切！"
PhotoboothSoloALines_Male[4]="滴答，滴答，砰！"
PhotoboothSoloALines_Male[5]="感受燃烧！"
PhotoboothSoloALines_Male[6]="子弹当然是越多越好！"
PhotoboothSoloALines_Male[7]="哈哈哈！居然被发现了！"

PhotoboothSoloALines_Female[0]="乒乒乓乓！然后...砰！"
PhotoboothSoloALines_Female[1]="警报！附加伤害。"
PhotoboothSoloALines_Female[2]="祈祷吧。这没有怜悯！"
PhotoboothSoloALines_Female[3]="燃烧一切！"
PhotoboothSoloALines_Female[4]="滴答，滴答，砰！"
PhotoboothSoloALines_Female[5]="感受燃烧！"
PhotoboothSoloALines_Female[6]="子弹当然是越多越好！"
PhotoboothSoloALines_Female[7]="哈哈哈！居然被发现了！"

PhotoboothSoloBLines_Male[0]="乒乒乓乓！然后...砰！"
PhotoboothSoloBLines_Male[1]="警报！附加伤害。"
PhotoboothSoloBLines_Male[2]="祈祷吧。这没有怜悯！"
PhotoboothSoloBLines_Male[3]="燃烧一切！"
PhotoboothSoloBLines_Male[4]="滴答，滴答，砰！"
PhotoboothSoloBLines_Male[5]="感受燃烧！"
PhotoboothSoloBLines_Male[6]="子弹当然是越多越好！"
PhotoboothSoloBLines_Male[7]="哈哈哈！居然被发现了！"

PhotoboothSoloBLines_Female[0]="乒乒乓乓！然后...砰！"
PhotoboothSoloBLines_Female[1]="警报！附加伤害。"
PhotoboothSoloBLines_Female[2]="祈祷吧。这没有怜悯！"
PhotoboothSoloBLines_Female[3]="燃烧一切！"
PhotoboothSoloBLines_Female[4]="滴答，滴答，砰！"
PhotoboothSoloBLines_Female[5]="感受燃烧！"
PhotoboothSoloBLines_Female[6]="子弹当然是越多越好！"
PhotoboothSoloBLines_Female[7]="哈哈哈！居然被发现了！"

[WOTC_APA_Gauntlet X2AbilityTemplate]
LocFriendlyName = "Chemical Mixtures"
LocHelpText = "战斗工程师调整袖套的火焰喷射器能力的能力会随着经验的提高而提高。"
LocLongDescription = "战斗工程师调整袖套的火焰喷射器能力的能力会随着经验的提高而提高。"
LocPromotionPopupText = "<font color='#CA7200'>1级</font> (获得<Ability:RANKNAME1/> rank [1])<br/><Bullet/> 获得重型武器能力 - 允许使用袖套，火焰喷射器和迷你火箭发射器的组合。<br/><Bullet/> 获得爆炸填充<br/><Bullet/> 获得 +2 护盾（临时护盾值）生命值。<br/><font color='#CA7200'>2级</font> (获得<Ability:RANKNAME3/> rank [3])<br/><Bullet/>凝固汽油弹-X - 你的火焰喷射器现在可以使敌人迷失方向或惊慌。<br/><br/><Bullet/>获得 +2 护盾（临时护盾）生命值（共 4 点）。<br/><font color='#CA7200'>3级</font> (获得<Ability:RANKNAME6/> rank [6])<br/><Bullet/>获得火焰和钢铁 - 用你的手套攻击，以及手套武器设置的火焰，造成+1伤害。<br/><Bullet/>获得 快速燃烧 - 激活，以便您下次使用火焰喷射器时不会花费任何操作。<br/><br/><Bullet/>获得 +2 护盾（临时护盾）生命值（共 6 点）。<br/>"

;***************************************
;New Ability Descriptions
;***************************************
; - GTS Unlocks -

[WOTC_APA_GauntletUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "战斗工程师:应用化学1级"
Summary = "所有战斗工程师士兵的化学混合物熟练度现在将从 2 级开始，无论等级如何。"

[WOTC_APA_GauntletUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "战斗工程师:应用化学2级"
Summary = "所有战斗工程师士兵的化学混合物熟练度现在将从 3 级开始，无论等级如何。<br/><br/><font color='#CA7200'>需要应用化学1级</font>"



[Rusty_CloistaShield X2AbilityTemplate]
LocFriendlyName="隐蔽护盾"
LocLongDescription="在士兵和附近的盟友周围投射盾牌。如果这个士兵被杀死，盾牌就会崩溃。这是一项免费动作，要求士兵有 2AP（所以必须是第一个动作）并且有 2 次充能和 5 回合冷却时间。"
LocHelpText="围绕附近的盟友和你自己投射盾牌。自由行动要求：2行动点. 2 充能 5 回合冷却。"
LocFlyOverText="护盾升级"
LocPromotionPopupText="<Bullet/>技能点消耗：<Ability:WSS_AP/>.\n<Bullet/>是自由操作： <Ability:WSS_ISFREE/>.\n<Bullet/>结束转弯: <Ability:WSS_ENDSTURN/>\n<Bullet/>冷却时间: <Ability:WSS_COOLDOWN/>\n<Bullet/>消耗 :<Ability:WSS_CHARGES/>\n<Bullet/>可以在混乱时使用 <Ability:WSS_DISORIENT/>\n<Bullet/>可在燃烧时使用: <Ability:WSS_BURNING/>\n<Bullet/>半径:<Ability:WSS_RADIUS/>\n<Bullet/>赋予临时护盾值: <Ability:WSS_SHIELDHP/>  (如果不使用能量护盾大改)."


;***************************************
;New Ability Descriptions
;***************************************

[MKP_MrCloista X2AbilityTemplate]
LocFriendlyName="次要动力学护盾"
LocLongDescription="增加 <Ability:iMKP_ADDSHIELDBOOST/>动力吸收。对本单位的射击失误将使护盾提高<Ability:iMKP_SHIELDSPERMISS/>."
LocHelpText="增加 <Ability:iMKP_ADDSHIELDBOOST/>动力吸收。对本单位的射击失误将使护盾提高<Ability:iMKP_SHIELDSPERMISS/>."
LocPromotionPopupText="增加 <Ability:iMKP_ADDSHIELDBOOST/>动力吸收。对本单位的射击失误将使护盾提高<Ability:iMKP_SHIELDSPERMISS/>."
LocFlyOverText="动力护盾"

[MKP_Cloista_Overload X2AbilityTemplate]
LocFriendlyName="次要动力学护盾 - 超载"
LocLongDescription="增加 <Ability:iMKP_ADDSHIELDBOOST/>动力吸收。对这个单位的未命中射击会增加护盾超过最大值<Ability:iMKP_MAXSHIELDREGEN/> 每个任务。发电机已重新载载并已暂时关闭。它需要在复仇者号上重新校准。"
LocHelpText="增加 <Ability:iMKP_ADDSHIELDBOOST/>动力吸收。对这个单位的未命中射击会增加护盾超过最大值<Ability:iMKP_MAXSHIELDREGEN/> 每个任务。发电机已重新载载并已暂时关闭。它需要在复仇者号上重新校准。"
LocFlyOverText="动力护盾 超载"

[MKP_MrCloista_Passive X2AbilityTemplate]
LocFriendlyName="次要动力学护盾"
LocLongDescription="增加 <Ability:iMKP_ADDSHIELDBOOST/>动力吸收。对本单位的射击失误将使护盾提高<Ability:iMKP_SHIELDSPERMISS/>."
LocHelpText="增加 <Ability:iMKP_ADDSHIELDBOOST/>动力吸收。对本单位的射击失误将使护盾提高<Ability:iMKP_SHIELDSPERMISS/>."

